tests/data/soap1.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"><soap:Body><pcsoap:publish xmlns:pcsoap="http://soap.publiccommons.ne.jp/"><pcsoap:message><edxlde:EDXLDistribution xmlns="http://soap.publiccommons.ne.jp/" xmlns:commons="http://xml.publiccommons.ne.jp/xml/edxl/" xmlns:edxlde="urn:oasis:names:tc:emergency:EDXL:DE:1.0" xmlns:pcx_eb="http://xml.publiccommons.ne.jp/pcxml1/elementBasis2/" xmlns:pcx_en="http://xml.publiccommons.ne.jp/pcxml1/body/event2/" xmlns:pcx_ib="http://xml.publiccommons.ne.jp/pcxml1/informationBasis2/" xmlns:pcxml="http://xml.publiccommons.ne.jp/pcxml1/2" xmlns:xs="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><edxlde:distributionID>5b5417ff-d928-4169-a7c7-bfed08eff483</edxlde:distributionID><edxlde:senderID>editor.foo.test</edxlde:senderID><edxlde:dateTimeSent>2013-04-10T18:57:05+09:00</edxlde:dateTimeSent><edxlde:distributionStatus>Test</edxlde:distributionStatus><edxlde:distributionType>Report</edxlde:distributionType><edxlde:combinedConfidentiality>UNCLASSIFIED AND NOT SENSITIVE</edxlde:combinedConfidentiality><edxlde:language>ja-JP</edxlde:language><commons:targetArea><commons:areaName>東京都千代田区</commons:areaName><commons:jisX0402>131016</commons:jisX0402></commons:targetArea><commons:contentObject><edxlde:contentDescription>避難準備  発令  04月10日午後06時55分 (一ツ橋一丁目、一ツ橋二丁目、猿楽町一丁目、猿楽町二丁目、外神田一丁目、外神田二丁目、外神田六丁目、丸の内一丁目、岩本町二丁目、岩本町三丁目、九段南三丁目、九段南四丁目)</edxlde:contentDescription><edxlde:xmlContent><edxlde:embeddedXMLContent><pcx_cns_i1:Report xmlns:pcx_cns_i1="http://xml.publiccommons.ne.jp/pcxml1/4" xmlns:pcx_cns_i10="http://xml.publiccommons.ne.jp/pcxml1/body/floodcontrolwarning4" xmlns:pcx_cns_i11="http://xml.publiccommons.ne.jp/pcxml1/body/rainfall4" xmlns:pcx_cns_i12="http://xml.publiccommons.ne.jp/pcxml1/body/shelter4" xmlns:pcx_cns_i13="http://xml.publiccommons.ne.jp/pcxml1/body/waterlevel4" xmlns:pcx_cns_i14="http://xml.publiccommons.ne.jp/pcxml1/body/familiariseriver4" xmlns:pcx_cns_i15="http://xml.publiccommons.ne.jp/pcxml1/html4/" xmlns:pcx_cns_i16="http://xml.publiccommons.ne.jp/pcxml1/body/GeneralInformation4" xmlns:pcx_cns_i17="http://xml.publiccommons.ne.jp/pcxml1/body/UrgentMail4" xmlns:pcx_cns_i18="http://xml.publiccommons.ne.jp/pcxml1/body/System4" xmlns:pcx_cns_i19="urn:oasis:names:tc:emergency:EDXL:DE:1.0" xmlns:pcx_cns_i2="http://xml.publiccommons.ne.jp/pcxml1/addition4/" xmlns:pcx_cns_i20="http://xml.publiccommons.ne.jp/xml/edxl/" xmlns:pcx_cns_i21="http://xml.publiccommons.ne.jp/xml/edxl/ext/comet-edxl/" xmlns:pcx_cns_i22="http://xml.publiccommons.ne.jp/pcxml1/gaugingStationCode-2009" xmlns:pcx_cns_i23="http://xml.publiccommons.ne.jp/pcxml1/reservoirsCode-2009" xmlns:pcx_cns_i24="http://xml.publiccommons.ne.jp/pcxml1/riverCode-2009" xmlns:pcx_cns_i3="http://xml.publiccommons.ne.jp/pcxml1/informationBasis4/" xmlns:pcx_cns_i4="http://xml.publiccommons.ne.jp/pcxml1/elementBasis4/" xmlns:pcx_cns_i5="http://xml.publiccommons.ne.jp/pcxml1/body/AntidisasterHeadquarter4" xmlns:pcx_cns_i6="http://xml.publiccommons.ne.jp/pcxml1/body/DamageInformation4" xmlns:pcx_cns_i7="http://xml.publiccommons.ne.jp/pcxml1/body/SedimentDisastersWarning4" xmlns:pcx_cns_i8="http://xml.publiccommons.ne.jp/pcxml1/body/evacuation4" xmlns:pcx_cns_i9="http://xml.publiccommons.ne.jp/pcxml1/body/event4"><pcx_cns_i1:Control><pcx_cns_i1:Title>EvacuationOrder</pcx_cns_i1:Title><pcx_cns_i19:distributionStatus>Test</pcx_cns_i19:distributionStatus><pcx_cns_i1:EditorialOffice><pcx_cns_i4:OrganizationCode>131016</pcx_cns_i4:OrganizationCode><pcx_cns_i4:ContactInfo pcx_cns_i4:contactType="phone" /><pcx_cns_i4:ContactInfo pcx_cns_i4:contactType="fax" /><pcx_cns_i4:ContactInfo pcx_cns_i4:contactType="e-mail" /><pcx_cns_i4:ContactInfo pcx_cns_i4:contactType="personResponsible" /><pcx_cns_i4:OfficeName>危機管理室（仮）</pcx_cns_i4:OfficeName><pcx_cns_i4:OfficeNameKana /><pcx_cns_i4:OfficeLocation><pcx_cns_i19:circle /><pcx_cns_i19:polygon /><pcx_cns_i20:areaName /><pcx_cns_i20:ooAzaTyouTyouMokuCode /></pcx_cns_i4:OfficeLocation><pcx_cns_i4:OfficeDomainName /><pcx_cns_i4:OrganizationName>東京都千代田区</pcx_cns_i4:OrganizationName></pcx_cns_i1:EditorialOffice><pcx_cns_i1:PublishingOffice><pcx_cns_i4:OfficeInfo><pcx_cns_i4:OrganizationCode>131016</pcx_cns_i4:OrganizationCode><pcx_cns_i4:ContactInfo pcx_cns_i4:contactType="phone" /><pcx_cns_i4:ContactInfo pcx_cns_i4:contactType="fax" /><pcx_cns_i4:ContactInfo pcx_cns_i4:contactType="e-mail" /><pcx_cns_i4:ContactInfo pcx_cns_i4:contactType="personResponsible" /><pcx_cns_i4:OfficeName>危機管理室（仮）</pcx_cns_i4:OfficeName><pcx_cns_i4:OfficeNameKana /><pcx_cns_i4:OfficeLocation><pcx_cns_i19:circle /><pcx_cns_i19:polygon /><pcx_cns_i20:areaName /><pcx_cns_i20:ooAzaTyouTyouMokuCode /></pcx_cns_i4:OfficeLocation><pcx_cns_i4:OfficeDomainName /><pcx_cns_i4:OrganizationName>東京都千代田区</pcx_cns_i4:OrganizationName></pcx_cns_i4:OfficeInfo></pcx_cns_i1:PublishingOffice></pcx_cns_i1:Control><pcx_cns_i3:Head><pcx_cns_i3:Title>東京都千代田区 避難勧告・指示情報 試験災害</pcx_cns_i3:Title><pcx_cns_i3:CreateDateTime>2013-04-10T18:57:05+09:00</pcx_cns_i3:CreateDateTime><pcx_cns_i3:FirstCreateDateTime>2013-04-10T18:57:05+09:00</pcx_cns_i3:FirstCreateDateTime><pcx_cns_i3:ReportDateTime>2013-04-10T18:54:00+09:00</pcx_cns_i3:ReportDateTime><pcx_cns_i3:TargetDateTime>2013-04-10T18:54:00+09:00</pcx_cns_i3:TargetDateTime><pcx_cns_i3:ValidDateTime>2013-04-12T18:56:00+09:00</pcx_cns_i3:ValidDateTime><pcx_cns_i19:distributionID>5b5417ff-d928-4169-a7c7-bfed08eff483</pcx_cns_i19:distributionID><pcx_cns_i19:distributionType>Report</pcx_cns_i19:distributionType><pcx_cns_i20:documentRevision>1</pcx_cns_i20:documentRevision><pcx_cns_i20:documentID>74ee219a-970d-417f-a9ab-a9ff1d3fe316</pcx_cns_i20:documentID><pcx_cns_i3:Headline><pcx_cns_i3:Text>避難準備  発令  04月10日午後06時55分 (一ツ橋一丁目、一ツ橋二丁目、猿楽町一丁目、猿楽町二丁目、外神田一丁目、外神田二丁目、外神田六丁目、丸の内一丁目、岩本町二丁目、岩本町三丁目、九段南三丁目、九段南四丁目)</pcx_cns_i3:Text><pcx_cns_i3:Areas><pcx_cns_i3:Area><pcx_cns_i19:circle /><pcx_cns_i19:polygon /><pcx_cns_i20:areaName>東京都千代田区</pcx_cns_i20:areaName><pcx_cns_i20:areaNameKana /><pcx_cns_i20:jisX0402>131016</pcx_cns_i20:jisX0402><pcx_cns_i20:ooAzaTyouTyouMokuCode /></pcx_cns_i3:Area></pcx_cns_i3:Areas></pcx_cns_i3:Headline></pcx_cns_i3:Head><pcx_cns_i8:EvacuationOrder><pcx_cns_i4:Disaster><pcx_cns_i4:DisasterName>試験災害</pcx_cns_i4:DisasterName></pcx_cns_i4:Disaster><pcx_cns_i8:ComplementaryInfo /><pcx_cns_i8:TotalNumber /><pcx_cns_i8:Detail><pcx_cns_i8:Sort>避難準備</pcx_cns_i8:Sort><pcx_cns_i8:IssueOrLift>発令</pcx_cns_i8:IssueOrLift><pcx_cns_i8:Object /><pcx_cns_i8:Areas><pcx_cns_i8:Area><pcx_cns_i4:Location><pcx_cns_i19:circle>35.691634,139.756685,0</pcx_cns_i19:circle><pcx_cns_i19:polygon /><pcx_cns_i20:areaName>一ツ橋一丁目</pcx_cns_i20:areaName><pcx_cns_i20:areaNameKana /><pcx_cns_i20:jisX0402>131016</pcx_cns_i20:jisX0402><pcx_cns_i20:ooAzaTyouTyouMokuCode>131010001001</pcx_cns_i20:ooAzaTyouTyouMokuCode></pcx_cns_i4:Location><pcx_cns_i8:DateTime>2013-04-10T18:55:00+09:00</pcx_cns_i8:DateTime><pcx_cns_i8:Object /></pcx_cns_i8:Area><pcx_cns_i8:Area><pcx_cns_i4:Location><pcx_cns_i19:circle>35.692947,139.75732,0</pcx_cns_i19:circle><pcx_cns_i19:polygon /><pcx_cns_i20:areaName>一ツ橋二丁目</pcx_cns_i20:areaName><pcx_cns_i20:areaNameKana /><pcx_cns_i20:jisX0402>131016</pcx_cns_i20:jisX0402><pcx_cns_i20:ooAzaTyouTyouMokuCode>131010001002</pcx_cns_i20:ooAzaTyouTyouMokuCode></pcx_cns_i4:Location><pcx_cns_i8:DateTime>2013-04-10T18:55:00+09:00</pcx_cns_i8:DateTime><pcx_cns_i8:Object /></pcx_cns_i8:Area><pcx_cns_i8:Area><pcx_cns_i4:Location><pcx_cns_i19:circle>35.698471,139.759949,0</pcx_cns_i19:circle><pcx_cns_i19:polygon /><pcx_cns_i20:areaName>猿楽町一丁目</pcx_cns_i20:areaName><pcx_cns_i20:areaNameKana /><pcx_cns_i20:jisX0402>131016</pcx_cns_i20:jisX0402><pcx_cns_i20:ooAzaTyouTyouMokuCode>131010004001</pcx_cns_i20:ooAzaTyouTyouMokuCode></pcx_cns_i4:Location><pcx_cns_i8:DateTime>2013-04-10T18:55:00+09:00</pcx_cns_i8:DateTime><pcx_cns_i8:Object /></pcx_cns_i8:Area><pcx_cns_i8:Area><pcx_cns_i4:Location><pcx_cns_i19:circle>35.700021,139.758377,0</pcx_cns_i19:circle><pcx_cns_i19:polygon /><pcx_cns_i20:areaName>猿楽町二丁目</pcx_cns_i20:areaName><pcx_cns_i20:areaNameKana /><pcx_cns_i20:jisX0402>131016</pcx_cns_i20:jisX0402><pcx_cns_i20:ooAzaTyouTyouMokuCode>131010004002</pcx_cns_i20:ooAzaTyouTyouMokuCode></pcx_cns_i4:Location><pcx_cns_i8:DateTime>2013-04-10T18:55:00+09:00</pcx_cns_i8:DateTime><pcx_cns_i8:Object /></pcx_cns_i8:Area><pcx_cns_i8:Area><pcx_cns_i4:Location><pcx_cns_i19:circle>35.699086,139.770116,0</pcx_cns_i19:circle><pcx_cns_i19:polygon /><pcx_cns_i20:areaName>外神田一丁目</pcx_cns_i20:areaName><pcx_cns_i20:areaNameKana /><pcx_cns_i20:jisX0402>131016</pcx_cns_i20:jisX0402><pcx_cns_i20:ooAzaTyouTyouMokuCode>131010006001</pcx_cns_i20:ooAzaTyouTyouMokuCode></pcx_cns_i4:Location><pcx_cns_i8:DateTime>2013-04-10T18:55:00+09:00</pcx_cns_i8:DateTime><pcx_cns_i8:Object /></pcx_cns_i8:Area><pcx_cns_i8:Area><pcx_cns_i4:Location><pcx_cns_i19:circle>35.701975,139.767997,0</pcx_cns_i19:circle><pcx_cns_i19:polygon /><pcx_cns_i20:areaName>外神田二丁目</pcx_cns_i20:areaName><pcx_cns_i20:areaNameKana /><pcx_cns_i20:jisX0402>131016</pcx_cns_i20:jisX0402><pcx_cns_i20:ooAzaTyouTyouMokuCode>131010006002</pcx_cns_i20:ooAzaTyouTyouMokuCode></pcx_cns_i4:Location><pcx_cns_i8:DateTime>2013-04-10T18:55:00+09:00</pcx_cns_i8:DateTime><pcx_cns_i8:Object /></pcx_cns_i8:Area><pcx_cns_i8:Area><pcx_cns_i4:Location><pcx_cns_i19:circle>35.704048,139.770903,0</pcx_cns_i19:circle><pcx_cns_i19:polygon /><pcx_cns_i20:areaName>外神田六丁目</pcx_cns_i20:areaName><pcx_cns_i20:areaNameKana /><pcx_cns_i20:jisX0402>131016</pcx_cns_i20:jisX0402><pcx_cns_i20:ooAzaTyouTyouMokuCode>131010006006</pcx_cns_i20:ooAzaTyouTyouMokuCode></pcx_cns_i4:Location><pcx_cns_i8:DateTime>2013-04-10T18:55:00+09:00</pcx_cns_i8:DateTime><pcx_cns_i8:Object /></pcx_cns_i8:Area><pcx_cns_i8:Area><pcx_cns_i4:Location><pcx_cns_i19:circle>35.683021,139.764079,0</pcx_cns_i19:circle><pcx_cns_i19:polygon /><pcx_cns_i20:areaName>丸の内一丁目</pcx_cns_i20:areaName><pcx_cns_i20:areaNameKana /><pcx_cns_i20:jisX0402>131016</pcx_cns_i20:jisX0402><pcx_cns_i20:ooAzaTyouTyouMokuCode>131010007001</pcx_cns_i20:ooAzaTyouTyouMokuCode></pcx_cns_i4:Location><pcx_cns_i8:DateTime>2013-04-10T18:55:00+09:00</pcx_cns_i8:DateTime><pcx_cns_i8:Object /></pcx_cns_i8:Area><pcx_cns_i8:Area><pcx_cns_i4:Location><pcx_cns_i19:circle>35.693459,139.776662,0</pcx_cns_i19:circle><pcx_cns_i19:polygon /><pcx_cns_i20:areaName>岩本町二丁目</pcx_cns_i20:areaName><pcx_cns_i20:areaNameKana /><pcx_cns_i20:jisX0402>131016</pcx_cns_i20:jisX0402><pcx_cns_i20:ooAzaTyouTyouMokuCode>131010008002</pcx_cns_i20:ooAzaTyouTyouMokuCode></pcx_cns_i4:Location><pcx_cns_i8:DateTime>2013-04-10T18:55:00+09:00</pcx_cns_i8:DateTime><pcx_cns_i8:Object /></pcx_cns_i8:Area><pcx_cns_i8:Area><pcx_cns_i4:Location><pcx_cns_i19:circle>35.695781,139.777161,0</pcx_cns_i19:circle><pcx_cns_i19:polygon /><pcx_cns_i20:areaName>岩本町三丁目</pcx_cns_i20:areaName><pcx_cns_i20:areaNameKana /><pcx_cns_i20:jisX0402>131016</pcx_cns_i20:jisX0402><pcx_cns_i20:ooAzaTyouTyouMokuCode>131010008003</pcx_cns_i20:ooAzaTyouTyouMokuCode></pcx_cns_i4:Location><pcx_cns_i8:DateTime>2013-04-10T18:55:00+09:00</pcx_cns_i8:DateTime><pcx_cns_i8:Object /></pcx_cns_i8:Area><pcx_cns_i8:Area><pcx_cns_i4:Location><pcx_cns_i19:circle>35.692442,139.74209,0</pcx_cns_i19:circle><pcx_cns_i19:polygon /><pcx_cns_i20:areaName>九段南三丁目</pcx_cns_i20:areaName><pcx_cns_i20:areaNameKana /><pcx_cns_i20:jisX0402>131016</pcx_cns_i20:jisX0402><pcx_cns_i20:ooAzaTyouTyouMokuCode>131010010003</pcx_cns_i20:ooAzaTyouTyouMokuCode></pcx_cns_i4:Location><pcx_cns_i8:DateTime>2013-04-10T18:55:00+09:00</pcx_cns_i8:DateTime><pcx_cns_i8:Object /></pcx_cns_i8:Area><pcx_cns_i8:Area><pcx_cns_i4:Location><pcx_cns_i19:circle>35.690945,139.738057,0</pcx_cns_i19:circle><pcx_cns_i19:polygon /><pcx_cns_i20:areaName>九段南四丁目</pcx_cns_i20:areaName><pcx_cns_i20:areaNameKana /><pcx_cns_i20:jisX0402>131016</pcx_cns_i20:jisX0402><pcx_cns_i20:ooAzaTyouTyouMokuCode>131010010004</pcx_cns_i20:ooAzaTyouTyouMokuCode></pcx_cns_i4:Location><pcx_cns_i8:DateTime>2013-04-10T18:55:00+09:00</pcx_cns_i8:DateTime><pcx_cns_i8:Object /></pcx_cns_i8:Area></pcx_cns_i8:Areas></pcx_cns_i8:Detail></pcx_cns_i8:EvacuationOrder></pcx_cns_i1:Report></edxlde:embeddedXMLContent></edxlde:xmlContent><commons:publishingOfficeName>危機管理室（仮）</commons:publishingOfficeName><commons:publishingOfficeID>131016</commons:publishingOfficeID><commons:documentRevision>1</commons:documentRevision><commons:documentID>74ee219a-970d-417f-a9ab-a9ff1d3fe316</commons:documentID><commons:category>EvacuationOrder</commons:category><commons:urgency>Future</commons:urgency><commons:severity>Severe</commons:severity><commons:certainty>Observed</commons:certainty><commons:received><commons:nodeId>TEST</commons:nodeId><commons:receivedTime>2013-04-10T18:57:07.629+09:00</commons:receivedTime><commons:endpointId>TEST-TPS1</commons:endpointId></commons:received></commons:contentObject></edxlde:EDXLDistribution></pcsoap:message></pcsoap:publish></soap:Body></soap:Envelope>
